backend/app/controllers/employees_controller.rb

  def index
    page = params[:page].to_i > 0 ? params[:page].to_i : 1
    per_page = params[:per_page].to_i > 0 ? params[:per_page].to_i : 10

    employees = Employee.includes(:user)

    if params[:search].present?
      employees = employees.where("LOWER(full_name) LIKE ?", "%#{params[:search].downcase}%")
    end

    if params[:job_title].present?
      employees = employees.where(job_title: params[:job_title])
    end

    employees = employees.offset((page - 1) * per_page).limit(per_page)
---
SELECT "employees".* FROM "employees"
SELECT "users".* FROM "users" WHERE "users"."employee_id" IN ($1, $2, $3)  [["employee_id", 3], ["employee_id", 4], ["employee_id", 5]]
SELECT "employees".* FROM "employees" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    employee = Employee.create!(employee_params)
---
INSERT INTO "employees" ("country", "created_at", "date_of_joining", "department", "full_name", "job_title", "salary", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @employee.update!(employee_params)
---
UPDATE "employees" SET "full_name" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["full_name", "Updated Name"], ["updated_at", "2026-04-20 10:15:13.391466"], ["id", 46]]