backend/app/controllers/insights_controller.rb

SELECT MIN("employees"."salary") FROM "employees" WHERE "employees"."country" = $1  [["country", "India"]]
---
  def salary
    employees = Employee.where(country: params[:country])

    render json: {
      min: employees.minimum(:salary).to_f,
      max: employees.maximum(:salary).to_f,
      avg: employees.average(:salary).to_f