backend/app/controllers/payroll_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."employee_id" = $1 ORDER BY "attendances"."id" DESC LIMIT $2  [["employee_id", 106], ["LIMIT", 1]]
---
  def show
    employee = Employee.find(params[:employee_id])
    attendance = employee.attendances.last